PROYECTO-API/app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'andresvillaz1@gmail.com'
 LIMIT 1
---
    public function index()
    {
        $userModel = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $user = $userModel->where('email', $email)->first();