PROYECTO-API/app/Controllers/Parqueadero.php

SELECT *
FROM `tb_parqueadero`
ORDER BY `id_ubicacion`
---
    public function index()
    {
        $parqueadero = new ParqueaderoModel();
        $data['parqueadero'] = $parqueadero->orderBy('id_ubicacion')->findAll();