PROYECTO-API/app/Controllers/Register.php

    public function index()
    {
        $rules = [
            'email' => ['rules' => 'required|min_length[4]|max_length[255]|valid_email|is_unique[users.email]'],
            'password' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'confirm_password' => [ 'label' => 'confirm password', 'rules' => 'matches[password]']
        ];

        if($this->validate($rules)){
            $model = new UserModel();
            $data = [
                'email'    => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $model->save($data);
---
INSERT INTO `users` (`email`, `password`, `created_at`, `update_at`) VALUES ('andresvillaz1@gmail.com', '$2y$10$46b.mGgXfLOz.gHM2qN57OEUNym/Z7Z4OxeY7kcGoRZOIFuG32wzu', '2024-09-20 12:56:24', '2024-09-20 12:56:24')