PROYECTO-API/app/Controllers/Residente.php

SELECT *
FROM `tb_residente`
ORDER BY `identificacion`
---
    public function index()
    {
        $residente = new ResidenteModel();
        $data['tb_residente'] = $residente->orderBy('identificacion')->findAll();